In [28]:
import pandas as pd
obj=pd.Series(['c','a','d','a','a','b','b','c','c'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [33]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [35]:
mask=obj.isin(['b','c'])
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [37]:
from numpy import nan as NA
data = pd.Series([1,NA, 3.5, NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [49]:
data2=pd.DataFrame([[1,6.5,3],[1, NA, NA],[NA,NA,NA],[NA,6.5,3]])
data2[4]=NA
data2.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [58]:
data3=pd.DataFrame(np.random.rand(7,3))
data3.loc[:4,1]=NA
data3.loc[:2,2]=NA
data3

          0         1         2
0  0.341269       NaN       NaN
1  0.231780       NaN       NaN
2  0.203892       NaN       NaN
3  0.619512       NaN  0.177848
4  0.818807       NaN  0.542599
5  0.462795  0.132483  0.938360
6  0.830592  0.652968  0.454003

In [60]:
data3.fillna(1)

          0         1         2
0  0.341269  1.000000  1.000000
1  0.231780  1.000000  1.000000
2  0.203892  1.000000  1.000000
3  0.619512  1.000000  0.177848
4  0.818807  1.000000  0.542599
5  0.462795  0.132483  0.938360
6  0.830592  0.652968  0.454003

In [64]:
data3.fillna(method='ffill', axis=1)

          0         1         2
0  0.341269  0.341269  0.341269
1  0.231780  0.231780  0.231780
2  0.203892  0.203892  0.203892
3  0.619512  0.619512  0.177848
4  0.818807  0.818807  0.542599
5  0.462795  0.132483  0.938360
6  0.830592  0.652968  0.454003

In [81]:
data4=pd.Series(np.random.rand(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data4[:,1]

a    0.605270
b    0.646633
c    0.013245
dtype: float64

In [86]:
data4.unstack().swapaxes(1,0)

          a         b         c         d
1  0.605270  0.646633  0.013245       NaN
2  0.963341  0.216325  0.083709  0.598471
3  0.463362  0.259522       NaN  0.934992